app/controllers/cart_items_controller.rb

  def create
    @cart = Cart.find_by(user: current_user)
    @item = Item.find_by(id: params[:item_id])
    @cart_item = CartItem.new(cart: @cart, item: @item)
      if @cart_item.save
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
INSERT INTO "cart_items" ("item_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["item_id", 3], ["created_at", "2020-03-11 09:35:47.309222"], ["updated_at", "2020-03-11 09:35:47.309222"]]